Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2025daa169.h
extern volatile __C2FIFOINT20bits_t C2FIFOINT20bits __asm__ ("C2FIFOINT20") __attribute__((section("sfrs"), address(0xBF881860)));
extern volatile uint32_t        C2FIFOINT20CLR __attribute__((section("sfrs"),address(0xBF881864)));
extern volatile uint32_t        C2FIFOINT20SET __attribute__((section("sfrs"),address(0xBF881868)));
extern volatile uint32_t        C2FIFOINT20INV __attribute__((section("sfrs"),address(0xBF88186C)));
#define C2FIFOUA20 C2FIFOUA20
extern volatile uint32_t   C2FIFOUA20 __attribute__((section("sfrs"), address(0xBF881870)));
extern volatile uint32_t        C2FIFOUA20CLR __attribute__((section("sfrs"),address(0xBF881874)));
extern volatile uint32_t        C2FIFOUA20SET __attribute__((section("sfrs"),address(0xBF881878)));
extern volatile uint32_t        C2FIFOUA20INV __attribute__((section("sfrs"),address(0xBF88187C)));
#define C2FIFOCI20 C2FIFOCI20
extern volatile uint32_t   C2FIFOCI20 __attribute__((section("sfrs"), address(0xBF881880)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI20bits_t;
extern volatile __C2FIFOCI20bits_t C2FIFOCI20bits __asm__ ("C2FIFOCI20") __attribute__((section("sfrs"), address(0xBF881880)));
extern volatile uint32_t        C2FIFOCI20CLR __attribute__((section("sfrs"),address(0xBF881884)));
extern volatile uint32_t        C2FIFOCI20SET __attribute__((section("sfrs"),address(0xBF881888)));
extern volatile uint32_t        C2FIFOCI20INV __attribute__((section("sfrs"),address(0xBF88188C)));
#define C2FIFOCON21 C2FIFOCON21
extern volatile uint32_t   C2FIFOCON21 __attribute__((section("sfrs"), address(0xBF881890)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON21bits_t;
extern volatile __C2FIFOCON21bits_t C2FIFOCON21bits __asm__ ("C2FIFOCON21") __attribute__((section("sfrs"), address(0xBF881890)));
extern volatile uint32_t        C2FIFOCON21CLR __attribute__((section("sfrs"),address(0xBF881894)));
extern volatile uint32_t        C2FIFOCON21SET __attribute__((section("sfrs"),address(0xBF881898)));
extern volatile uint32_t        C2FIFOCON21INV __attribute__((section("sfrs"),address(0xBF88189C)));
#define C2FIFOINT21 C2FIFOINT21
extern volatile uint32_t   C2FIFOINT21 __attribute__((section("sfrs"), address(0xBF8818A0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT21bits_t;
extern volatile __C2FIFOINT21bits_t C2FIFOINT21bits __asm__ ("C2FIFOINT21") __attribute__((section("sfrs"), address(0xBF8818A0)));
extern volatile uint32_t        C2FIFOINT21CLR __attribute__((section("sfrs"),address(0xBF8818A4)));
extern volatile uint32_t        C2FIFOINT21SET __attribute__((section("sfrs"),address(0xBF8818A8)));
extern volatile uint32_t        C2FIFOINT21INV __attribute__((section("sfrs"),address(0xBF8818AC)));
#define C2FIFOUA21 C2FIFOUA21
extern volatile uint32_t   C2FIFOUA21 __attribute__((section("sfrs"), address(0xBF8818B0)));
extern volatile uint32_t        C2FIFOUA21CLR __attribute__((section("sfrs"),address(0xBF8818B4)));
extern volatile uint32_t        C2FIFOUA21SET __attribute__((section("sfrs"),address(0xBF8818B8)));
extern volatile uint32_t        C2FIFOUA21INV __attribute__((section("sfrs"),address(0xBF8818BC)));
#define C2FIFOCI21 C2FIFOCI21
extern volatile uint32_t   C2FIFOCI21 __attribute__((section("sfrs"), address(0xBF8818C0)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI21bits_t;
extern volatile __C2FIFOCI21bits_t C2FIFOCI21bits __asm__ ("C2FIFOCI21") __attribute__((section("sfrs"), address(0xBF8818C0)));
extern volatile uint32_t        C2FIFOCI21CLR __attribute__((section("sfrs"),address(0xBF8818C4)));
extern volatile uint32_t        C2FIFOCI21SET __attribute__((section("sfrs"),address(0xBF8818C8)));
extern volatile uint32_t        C2FIFOCI21INV __attribute__((section("sfrs"),address(0xBF8818CC)));
#define C2FIFOCON22 C2FIFOCON22
extern volatile uint32_t   C2FIFOCON22 __attribute__((section("sfrs"), address(0xBF8818D0)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON22bits_t;
extern volatile __C2FIFOCON22bits_t C2FIFOCON22bits __asm__ ("C2FIFOCON22") __attribute__((section("sfrs"), address(0xBF8818D0)));
extern volatile uint32_t        C2FIFOCON22CLR __attribute__((section("sfrs"),address(0xBF8818D4)));
extern volatile uint32_t        C2FIFOCON22SET __attribute__((section("sfrs"),address(0xBF8818D8)));
extern volatile uint32_t        C2FIFOCON22INV __attribute__((section("sfrs"),address(0xBF8818DC)));
#define C2FIFOINT22 C2FIFOINT22
extern volatile uint32_t   C2FIFOINT22 __attribute__((section("sfrs"), address(0xBF8818E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT22bits_t;
