Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2025daa169.h
#define _ADCEISTAT1_EIRDY31_POSITION             0x0000001F
#define _ADCEISTAT1_EIRDY31_MASK                 0x80000000
#define _ADCEISTAT1_EIRDY31_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY32_POSITION             0x00000000
#define _ADCEISTAT2_EIRDY32_MASK                 0x00000001
#define _ADCEISTAT2_EIRDY32_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY33_POSITION             0x00000001
#define _ADCEISTAT2_EIRDY33_MASK                 0x00000002
#define _ADCEISTAT2_EIRDY33_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY34_POSITION             0x00000002
#define _ADCEISTAT2_EIRDY34_MASK                 0x00000004
#define _ADCEISTAT2_EIRDY34_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY35_POSITION             0x00000003
#define _ADCEISTAT2_EIRDY35_MASK                 0x00000008
#define _ADCEISTAT2_EIRDY35_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY36_POSITION             0x00000004
#define _ADCEISTAT2_EIRDY36_MASK                 0x00000010
#define _ADCEISTAT2_EIRDY36_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY37_POSITION             0x00000005
#define _ADCEISTAT2_EIRDY37_MASK                 0x00000020
#define _ADCEISTAT2_EIRDY37_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY38_POSITION             0x00000006
#define _ADCEISTAT2_EIRDY38_MASK                 0x00000040
#define _ADCEISTAT2_EIRDY38_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY39_POSITION             0x00000007
#define _ADCEISTAT2_EIRDY39_MASK                 0x00000080
#define _ADCEISTAT2_EIRDY39_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY40_POSITION             0x00000008
#define _ADCEISTAT2_EIRDY40_MASK                 0x00000100
#define _ADCEISTAT2_EIRDY40_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY41_POSITION             0x00000009
#define _ADCEISTAT2_EIRDY41_MASK                 0x00000200
#define _ADCEISTAT2_EIRDY41_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY42_POSITION             0x0000000A
#define _ADCEISTAT2_EIRDY42_MASK                 0x00000400
#define _ADCEISTAT2_EIRDY42_LENGTH               0x00000001

#define _ADCEISTAT2_EIRDY43_POSITION             0x0000000B
#define _ADCEISTAT2_EIRDY43_MASK                 0x00000800
#define _ADCEISTAT2_EIRDY43_LENGTH               0x00000001

#define _ADCANCON_ANEN0_POSITION                 0x00000000
#define _ADCANCON_ANEN0_MASK                     0x00000001
#define _ADCANCON_ANEN0_LENGTH                   0x00000001

#define _ADCANCON_ANEN1_POSITION                 0x00000001
#define _ADCANCON_ANEN1_MASK                     0x00000002
#define _ADCANCON_ANEN1_LENGTH                   0x00000001

#define _ADCANCON_ANEN2_POSITION                 0x00000002
#define _ADCANCON_ANEN2_MASK                     0x00000004
#define _ADCANCON_ANEN2_LENGTH                   0x00000001

#define _ADCANCON_ANEN3_POSITION                 0x00000003
#define _ADCANCON_ANEN3_MASK                     0x00000008
#define _ADCANCON_ANEN3_LENGTH                   0x00000001

#define _ADCANCON_ANEN4_POSITION                 0x00000004
#define _ADCANCON_ANEN4_MASK                     0x00000010
#define _ADCANCON_ANEN4_LENGTH                   0x00000001

#define _ADCANCON_ANEN7_POSITION                 0x00000007
#define _ADCANCON_ANEN7_MASK                     0x00000080
#define _ADCANCON_ANEN7_LENGTH                   0x00000001

#define _ADCANCON_WKRDY0_POSITION                0x00000008
#define _ADCANCON_WKRDY0_MASK                    0x00000100
#define _ADCANCON_WKRDY0_LENGTH                  0x00000001

#define _ADCANCON_WKRDY1_POSITION                0x00000009
#define _ADCANCON_WKRDY1_MASK                    0x00000200
#define _ADCANCON_WKRDY1_LENGTH                  0x00000001

#define _ADCANCON_WKRDY2_POSITION                0x0000000A
#define _ADCANCON_WKRDY2_MASK                    0x00000400
#define _ADCANCON_WKRDY2_LENGTH                  0x00000001

#define _ADCANCON_WKRDY3_POSITION                0x0000000B
#define _ADCANCON_WKRDY3_MASK                    0x00000800
#define _ADCANCON_WKRDY3_LENGTH                  0x00000001

#define _ADCANCON_WKRDY4_POSITION                0x0000000C
#define _ADCANCON_WKRDY4_MASK                    0x00001000
#define _ADCANCON_WKRDY4_LENGTH                  0x00000001

#define _ADCANCON_WKRDY7_POSITION                0x0000000F
#define _ADCANCON_WKRDY7_MASK                    0x00008000
#define _ADCANCON_WKRDY7_LENGTH                  0x00000001

#define _ADCANCON_WKIEN0_POSITION                0x00000010
#define _ADCANCON_WKIEN0_MASK                    0x00010000
#define _ADCANCON_WKIEN0_LENGTH                  0x00000001

#define _ADCANCON_WKIEN1_POSITION                0x00000011
#define _ADCANCON_WKIEN1_MASK                    0x00020000
#define _ADCANCON_WKIEN1_LENGTH                  0x00000001

#define _ADCANCON_WKIEN2_POSITION                0x00000012
#define _ADCANCON_WKIEN2_MASK                    0x00040000
#define _ADCANCON_WKIEN2_LENGTH                  0x00000001

#define _ADCANCON_WKIEN3_POSITION                0x00000013
#define _ADCANCON_WKIEN3_MASK                    0x00080000
#define _ADCANCON_WKIEN3_LENGTH                  0x00000001

#define _ADCANCON_WKIEN4_POSITION                0x00000014
#define _ADCANCON_WKIEN4_MASK                    0x00100000
#define _ADCANCON_WKIEN4_LENGTH                  0x00000001

#define _ADCANCON_WKIEN7_POSITION                0x00000017
#define _ADCANCON_WKIEN7_MASK                    0x00800000
#define _ADCANCON_WKIEN7_LENGTH                  0x00000001

#define _ADCANCON_WKUPCLKCNT_POSITION            0x00000018
#define _ADCANCON_WKUPCLKCNT_MASK                0x0F000000
#define _ADCANCON_WKUPCLKCNT_LENGTH              0x00000004

#define _ADC0CFG_ADCCFG_POSITION                 0x00000000
#define _ADC0CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC0CFG_ADCCFG_LENGTH                   0x00000020

#define _ADC1CFG_ADCCFG_POSITION                 0x00000000
#define _ADC1CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC1CFG_ADCCFG_LENGTH                   0x00000020

#define _ADC2CFG_ADCCFG_POSITION                 0x00000000
#define _ADC2CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC2CFG_ADCCFG_LENGTH                   0x00000020

#define _ADC3CFG_ADCCFG_POSITION                 0x00000000
#define _ADC3CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC3CFG_ADCCFG_LENGTH                   0x00000020

#define _ADC4CFG_ADCCFG_POSITION                 0x00000000
#define _ADC4CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC4CFG_ADCCFG_LENGTH                   0x00000020

#define _ADC7CFG_ADCCFG_POSITION                 0x00000000
#define _ADC7CFG_ADCCFG_MASK                     0xFFFFFFFF
#define _ADC7CFG_ADCCFG_LENGTH                   0x00000020

