Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz2025daa169.h
#define _GLCDCLUT147_GREEN_POSITION              0x00000008
#define _GLCDCLUT147_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT147_GREEN_LENGTH                0x00000008

#define _GLCDCLUT147_RED_POSITION                0x00000010
#define _GLCDCLUT147_RED_MASK                    0x00FF0000
#define _GLCDCLUT147_RED_LENGTH                  0x00000008

#define _GLCDCLUT148_BLUE_POSITION               0x00000000
#define _GLCDCLUT148_BLUE_MASK                   0x000000FF
#define _GLCDCLUT148_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT148_GREEN_POSITION              0x00000008
#define _GLCDCLUT148_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT148_GREEN_LENGTH                0x00000008

#define _GLCDCLUT148_RED_POSITION                0x00000010
#define _GLCDCLUT148_RED_MASK                    0x00FF0000
#define _GLCDCLUT148_RED_LENGTH                  0x00000008

#define _GLCDCLUT149_BLUE_POSITION               0x00000000
#define _GLCDCLUT149_BLUE_MASK                   0x000000FF
#define _GLCDCLUT149_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT149_GREEN_POSITION              0x00000008
#define _GLCDCLUT149_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT149_GREEN_LENGTH                0x00000008

#define _GLCDCLUT149_RED_POSITION                0x00000010
#define _GLCDCLUT149_RED_MASK                    0x00FF0000
#define _GLCDCLUT149_RED_LENGTH                  0x00000008

#define _GLCDCLUT150_BLUE_POSITION               0x00000000
#define _GLCDCLUT150_BLUE_MASK                   0x000000FF
#define _GLCDCLUT150_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT150_GREEN_POSITION              0x00000008
#define _GLCDCLUT150_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT150_GREEN_LENGTH                0x00000008

#define _GLCDCLUT150_RED_POSITION                0x00000010
#define _GLCDCLUT150_RED_MASK                    0x00FF0000
#define _GLCDCLUT150_RED_LENGTH                  0x00000008

#define _GLCDCLUT151_BLUE_POSITION               0x00000000
#define _GLCDCLUT151_BLUE_MASK                   0x000000FF
#define _GLCDCLUT151_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT151_GREEN_POSITION              0x00000008
#define _GLCDCLUT151_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT151_GREEN_LENGTH                0x00000008

#define _GLCDCLUT151_RED_POSITION                0x00000010
#define _GLCDCLUT151_RED_MASK                    0x00FF0000
#define _GLCDCLUT151_RED_LENGTH                  0x00000008

#define _GLCDCLUT152_BLUE_POSITION               0x00000000
#define _GLCDCLUT152_BLUE_MASK                   0x000000FF
#define _GLCDCLUT152_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT152_GREEN_POSITION              0x00000008
#define _GLCDCLUT152_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT152_GREEN_LENGTH                0x00000008

#define _GLCDCLUT152_RED_POSITION                0x00000010
#define _GLCDCLUT152_RED_MASK                    0x00FF0000
#define _GLCDCLUT152_RED_LENGTH                  0x00000008

#define _GLCDCLUT153_BLUE_POSITION               0x00000000
#define _GLCDCLUT153_BLUE_MASK                   0x000000FF
#define _GLCDCLUT153_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT153_GREEN_POSITION              0x00000008
#define _GLCDCLUT153_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT153_GREEN_LENGTH                0x00000008

#define _GLCDCLUT153_RED_POSITION                0x00000010
#define _GLCDCLUT153_RED_MASK                    0x00FF0000
#define _GLCDCLUT153_RED_LENGTH                  0x00000008

#define _GLCDCLUT154_BLUE_POSITION               0x00000000
#define _GLCDCLUT154_BLUE_MASK                   0x000000FF
#define _GLCDCLUT154_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT154_GREEN_POSITION              0x00000008
#define _GLCDCLUT154_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT154_GREEN_LENGTH                0x00000008

#define _GLCDCLUT154_RED_POSITION                0x00000010
#define _GLCDCLUT154_RED_MASK                    0x00FF0000
#define _GLCDCLUT154_RED_LENGTH                  0x00000008

#define _GLCDCLUT155_BLUE_POSITION               0x00000000
#define _GLCDCLUT155_BLUE_MASK                   0x000000FF
#define _GLCDCLUT155_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT155_GREEN_POSITION              0x00000008
#define _GLCDCLUT155_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT155_GREEN_LENGTH                0x00000008

#define _GLCDCLUT155_RED_POSITION                0x00000010
#define _GLCDCLUT155_RED_MASK                    0x00FF0000
#define _GLCDCLUT155_RED_LENGTH                  0x00000008

#define _GLCDCLUT156_BLUE_POSITION               0x00000000
#define _GLCDCLUT156_BLUE_MASK                   0x000000FF
#define _GLCDCLUT156_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT156_GREEN_POSITION              0x00000008
#define _GLCDCLUT156_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT156_GREEN_LENGTH                0x00000008

#define _GLCDCLUT156_RED_POSITION                0x00000010
#define _GLCDCLUT156_RED_MASK                    0x00FF0000
#define _GLCDCLUT156_RED_LENGTH                  0x00000008

#define _GLCDCLUT157_BLUE_POSITION               0x00000000
#define _GLCDCLUT157_BLUE_MASK                   0x000000FF
#define _GLCDCLUT157_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT157_GREEN_POSITION              0x00000008
#define _GLCDCLUT157_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT157_GREEN_LENGTH                0x00000008

#define _GLCDCLUT157_RED_POSITION                0x00000010
#define _GLCDCLUT157_RED_MASK                    0x00FF0000
#define _GLCDCLUT157_RED_LENGTH                  0x00000008

#define _GLCDCLUT158_BLUE_POSITION               0x00000000
#define _GLCDCLUT158_BLUE_MASK                   0x000000FF
#define _GLCDCLUT158_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT158_GREEN_POSITION              0x00000008
#define _GLCDCLUT158_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT158_GREEN_LENGTH                0x00000008

#define _GLCDCLUT158_RED_POSITION                0x00000010
#define _GLCDCLUT158_RED_MASK                    0x00FF0000
#define _GLCDCLUT158_RED_LENGTH                  0x00000008

#define _GLCDCLUT159_BLUE_POSITION               0x00000000
#define _GLCDCLUT159_BLUE_MASK                   0x000000FF
#define _GLCDCLUT159_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT159_GREEN_POSITION              0x00000008
#define _GLCDCLUT159_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT159_GREEN_LENGTH                0x00000008

#define _GLCDCLUT159_RED_POSITION                0x00000010
#define _GLCDCLUT159_RED_MASK                    0x00FF0000
#define _GLCDCLUT159_RED_LENGTH                  0x00000008

#define _GLCDCLUT160_BLUE_POSITION               0x00000000
#define _GLCDCLUT160_BLUE_MASK                   0x000000FF
#define _GLCDCLUT160_BLUE_LENGTH                 0x00000008

